# У бабы Мани есть сейф, в котором она держит свои украшения. Код от сейфа состоит из трёх цифр, которые баба Маня в силу возраста постоянно забывает.
# Зная эту свою слабость, баба Маня написала себе следующие подсказки:
# 1.	1 7 2 — только одна верная цифра, и та не на своём месте;
# 2.	8 5 4 — две верные цифры, не на своих местах;
# 3.	9 8 6 — только одна верная цифра, и та не на своём месте;
# 4.	7 5 1 — только одна верная цифра, причём на своём месте.
# Ответ: 7 4 8

# В аптеке появилась необходимость точно отвешивать на чашечных весах различные веса лекарства от 1 до 40 граммов включительно.
# Сначала работники аптеки решили заказать для этого 40 гирь всех возможных весов от 1 до 40 граммов. Однако оказалось, что изготовление
# гирь для аптечных весов стоит весьма дорого.
#
# Каков набор с минимальным количеством гирь, с помощью которого можно отвешивать любое целое количество лекарства от 1 до 40 граммов?
#
# [Подразумевается хронологическая последовательность порядковых номеров гирь: от 1 до 40.]
#
# В ответ запишите числа — нужные порядковые номера гирь, через запятую, без дополнительных пробелов и символов до и после (например: 5,8,10,28).
# Ответ: 1,2,4,8,16,32

# Существует множество систем шифрования, которые используются в разных сферах: в военном деле, на дипломатической службе, для сохранения тайны содержания переписки и других.
# Простые приёмы шифрования получили своё распространение в эпоху античности, завершающем этапе Древних времён. Тайнописью пользовались и в России. 1549 год, период царствования Ивана IV, знаменуется появлением криптографической службы, которую полностью реорганизовал Пётр I, создав «Посольскую канцелярию». Применяются коды также в качестве приложения к «Цифровым азбукам».
# Предлагаем вам проверить свои знания в этой области.
# Дана последовательность заглавных букв, заменяющая буквы русского алфавита.
#
# ГШЫОЭЦМЪЩАВТХЯЬФУКЮРПСЗЖЛЁНДЕБЧИЙ
#
# Определите, сколько различных шифрованных текстов, включая совпадающий с исходным словом, можно получить из слова «НАСТАВНИК».
#
# К примеру, из слова «ГОД» получится зашифрованный текст «ОФЭ». Если применить замену к «ОФЭ», то получится «ФСЧ», и так далее. Через некоторое количество применений результат совпадёт с исходным словом «ГОД», после чего тексты начнут повторяться.
#
# Ответ запишите числом без дополнительных пробелов и символов до и после (например: 50).